package lesson_17

/**
 * Задача 3 к Уроку 17
 *
 * В приложении для хранения облачных файлов есть папки и файлы.
 *
 * Создай класс папки, который имеет имя, количество файлов и флаг “секретно”. Если флаг имеет значение true,
 * то при попытке прочитать имя, возвращать строку “скрытая папка” и количество файлов – 0. В ином случае возвращать
 * ее название и реальное количество файлов. Для реализации должны использоваться геттеры.
 *
 * Создай экземпляр “скрытой” папки. Протестируй попытку чтения ее данных.
 */
fun main() {

}