package lesson_19

/**
 * Задача 2 к Уроку 19
 *
 * В интернет-магазине товары делятся на несколько категорий: одежда, канцелярские товары и разное.
 *
 *  – создай enum класс с категориями;
 *  – создай метод внутри enum, который вернет текстовое название категории для пользователя;
 *  – создай класс, описывающий товар (с полями название, id, категория), в классе должен быть метод, который выводит
 *  инфо о товаре. Вызови его для нескольких созданных товаров;
 *  – для вывода информации о товаре, для категории используй метод определения категории.
 */
fun main() {

}