package lesson_19

/**
 * Задача 4 к Уроку 19
 *
 * В компьютерной игре танк может подбирать разные виды патронов. Патроны различаются силой удара.
 * Синие – 5 единиц,
 * зеленые – 10,
 * красные – 20.
 * – создай enum класс для патронов и класс танка. У танка должны быть методы вооружения новым типом патронов и
 * выстрела. При выстреле в консоль должен выводиться нанесенный урон;
 * – создай экземпляр танка и “произведи” несколько выстрелов разными патронами;
 * – экземпляр танка при создании ничем не заряжен;
 * – в решении должен использоваться enum.
 */
fun main() {

}