package lesson_22

/**
 * Задача 5* к Уроку 22
 *
 * В Путеводитель для путешествующих автостопом по Галактике добавляется информация о месте или событии в галактике
 * в виде объектов.
 * Создай data class GalacticGuide cо свойствами:
 * - название места или события;
 * - описание места или события;
 * - дата и время события;
 * - расстояние места или события от Земли в световых годах.
 *
 * Создай объект с информацией о звездной системе Alpha Centauri. Выведи информацию о месте, используя компонентные
 * функции data class.
 */
fun main() {

}