package lesson_15

/**
 * Задача 5* к Уроку 15
 *
 * В логике мобильной игры есть грузовые и легковые автомобили с такими параметрами:
 * - грузовые машины могут перевозить одного пассажира и 2 тонны груза;
 * - легковые не перевозят груз, но могут вместить до 3 пассажиров.
 *
 * Создай интерфейсы, обеспечивающие передвижение машин, перевозку пассажиров и перевозку грузов.
 * - учитывай максимальное и текущее количество перевозимых людей или грузов;
 * - интерфейсы должны содержать методы загрузки и разгрузки пассажиров или грузов.
 *
 * Спроектируй классы и несколько объектов. Вызови их методы, «перевезя» таким образом 6 человек и 2 тонны груза.
 */
fun main() {

}
