package lesson_15

/**
 * Задача 4 к Уроку 15
 *
 * На сайте музыкального магазина есть товары двух категорий: инструменты и комплектующие к ним. Все товары имеют
 * название и количество единиц на складе.
 * Для инструментов есть возможность поиска соответствующих комплектующих.
 *
 * Опиши классы для категорий товаров. Создай общий класс  для хранения общих свойств всех товаров. Имитируй процесс
 * поиска текстовым сообщением «Выполняется поиск». Для выноса логики поиска используй интерфейс.
 */
fun main() {

}