package lesson_18

/**
 * Задача 5* к Уроку 18
 *
 * В приложении есть экран, на котором можно рисовать различные фигуры, указывая координаты (x, y). Фигурами могут
 * быть круг, квадрат и точка. Координаты могут быть представлены типами данных Int и Float.
 *
 * Создайте класс Screen, который будет содержать методы draw для рисования каждой фигуры с координатами типов
 * Int и Float. Каждый метод должен возвращать строку, указывающую, какая фигура нарисована и в каких координатах.
 * Используйте перегрузку методов для реализации.
 */
fun main() {

}