package lesson_10

/**
 * Задача 1 к Уроку 10
 *
 * Напиши небольшую игру, в которой пользователь и компьютер по очереди бросают кости. Побеждает выбросивший
 * наибольшее число.
 * - поочередно выводи сообщение о ходе игрока и компьютера (отображать кто бросил, какие значения на кубиках);
 * - бросок кости вынеси в отдельную функцию, в которой генерируется случайное число от 1 до 6;
 * - в отдельные переменные сохрани результат работы функции для игрока и компьютера;
 * - после сравнения результатов, выведи соответствующее сообщение в консоль. Например: "Победило человечество" ,
 * "Победила машина" или "Победила дружба".
 */
fun main() {

}